// image 중 콘텐츠의 일부 (JS/TS Import)일 경우에는 이 파일에서 import한다.
// (이미지가 전달하고자 하는 핵심 정보를 담고 있거나, 상황에 따라 계속 변해야 할 때)

// UI 디자인 요소일 경우 
// - 공통적인 디자인 요소일 경우 해당 scss에서 import
// - 특정 화면 전용 요소일 경우 screens 폴더 내의 scss에서 import
// - 여러곳에서 재사용하거나 테마에 따라 이미지가 바뀌어야 하면 variables.scss
// (이미지가 없어도 서비스 이용에 지장이 없고 단순한 디자인 요소일 경우)

// ※ 다음 질문에 YES이면 ts에서 import, NO이면 scss에서 import이다
// - 이미지가 없으면 내용을 이해 못하나요? 
// - 이미지가 상황(State/Props)에 따라 바뀌나요?
// - 이미지에 링크나 클릭 이벤트가 직접 걸리나요?
// - 이미지가 <img> 태그로 쓰여야 하나요? (검색 엔진 노출, 접근성 필요)
// - 이미지가 사용자 데이터나 상태에 따라 바뀌나요?

// UI 디자인 요소임에도 JS/TS에서 import를 해야하는 경우는 아래 두가지이다.
// 1. 마우스 포인터의 위치나 특정 상태(State)에 따라 배경 이미지의 좌표나 종류가 실시간으로 변해야 하는 동적 스타일링일 경우
// 2. 아주 작은 아이콘이라서 별도의 HTTP 요청을 만드는 대신 번들러가 코드 안에 문자열로 박아버리길 원할 때(성능 최적화/Base64)